SEARCH_BY_GROUP = 'Поиск по группе'
SEARCH_BY_SUBGROUP = 'Поиск по подгруппе'
SEARCH_BY_TEACHER = 'Поиск по преподавателю'
SEARCH_ALL_TIME_TABLE = 'Вывод полного расписания'

ENTER_GROUP = "Введите номер группы.\n(Пример: кмбо-04-20)"
ENTER_SUBGROUP = "Введите номер подгруппы.\n(Пример: 1)"
ENTER_TEACHER = "Введите фамилию преподавателя.\n(Пример: головин)"
ENTER_DATE = "Введите дату в формате из примера " \
                                 "или воспользуйтесь ключами:\n" \
                                 "'1' (значение текущей даты)\n" \
                                 "'7' (вывод расписания на целую неделю)\n" \
                                 "ПРИМЕРЫ:\n21.08.2001\n1"
ENTER_COURSE_YEAR = "Выберите год курса: "

MESSAGE_ERROR_GROUP = "Такой группы не существует."
MESSAGE_ERROR_TEACHER = "Такой преподаватель у нас не работает("

INSTROUCTIONS_HELP = "help - дерево параметров поиска\n" \
               "Дерево поиска:\n" \
               "1) Поиск по группе - название группы - день недели (необязательно)\n" \
               "2) Поиск преподавателя - фамилия преподавателя - день недели (необязательно)\n" \
               "3) Вывод полного расписания - номер курса (необязательно)"


