SEARCH_BY_GROUP = 'Поиск по группе'
SEARCH_BY_TEACHER = 'Поиск по преподавателю'
SEARCH_ALL_TIME_TABLE = 'Вывод полного расписания'
SEARCH_BY_B209 = 'Когда свободна Б-209?'

ENTER_GROUP = "Введите номер группы.\n(Пример:\nкмбо-02-10\nкмбо 02 10\nкмбо0210)"
ENTER_TEACHER = "Введите фамилию преподавателя.\n(Пример: головин)"
ENTER_DATE = "Введите дату в формате примера " \
                                 "или воспользуйтесь ключами:\n" \
                                 "'1' (значение текущей даты)\n" \
                                 "'7' (вывод расписания на целую неделю)\n" \
                                 "ПРИМЕРЫ:\n1\n21.08.2001\n21/08/2001\n21 08 2001\n21082001"
ENTER_COURSE_YEAR = "Выберите год курса: "
ENTER_SUBGROUP = ""

MESSAGE_ERROR_GROUP = "Такой группы не существует."
MESSAGE_ERROR_TEACHER = "Такой преподаватель у нас не работает("
MESSAGE_ERROR_ALL_TIME_TABLE = "Выберите снова."
MESSAGE_SEND_NOTIFICATION = "Расписание на БК-536 изменилось!" \
                                  "\nПроверьте его здесь или на официальном сайте:" \
                                  "\nhttp://www.vega.fcyb.mirea.ru/"

INSTROUCTIONS_HELP = "help - дерево параметров поиска\n" \
               "Дерево поиска:\n" \
               "1) Поиск по группе - название группы - день недели (необязательно)\n" \
               "2) Поиск преподавателя - фамилия преподавателя - день недели (необязательно)\n" \
               "3) Вывод полного расписания - номер курса (необязательно)"


